MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64MC504/mcu.h
#define CM4FLTR CM4FLTR
extern volatile uint16_t CM4FLTR __attribute__((__sfr__));
__extension__ typedef struct tagCM4FLTRBITS {
  union {
    struct {
      uint16_t CFDIV:3;
      uint16_t CFLTREN:1;
      uint16_t CFSEL:3;
    };
    struct {
      uint16_t CFDIV0:1;
      uint16_t CFDIV1:1;
      uint16_t CFDIV2:1;
      uint16_t :1;
      uint16_t CFSEL0:1;
      uint16_t CFSEL1:1;
      uint16_t CFSEL2:1;
    };
  };
} CM4FLTRBITS;
extern volatile CM4FLTRBITS CM4FLTRbits __attribute__((__sfr__));

#define PTGCST PTGCST
extern volatile uint16_t PTGCST __attribute__((__sfr__));
typedef struct tagPTGCSTBITS {
  uint16_t PTGITM:2;
  uint16_t :4;
  uint16_t PTGWTO:1;
  uint16_t PTGSTRT:1;
  uint16_t PTGIVIS:1;
  uint16_t PTGSSEN:1;
  uint16_t PTGSWT:1;
  uint16_t :1;
  uint16_t PTGTOGL:1;
  uint16_t PTGSIDL:1;
  uint16_t :1;
  uint16_t PTGEN:1;
} PTGCSTBITS;
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile uint16_t PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  uint16_t PTGWDT:3;
  uint16_t :1;
  uint16_t PTGPWD:4;
  uint16_t PTGDIV:5;
  uint16_t PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile uint16_t PTGBTE __attribute__((__sfr__));
__extension__ typedef struct tagPTGBTEBITS {
  union {
    struct {
      uint16_t OC1TSS:1;
      uint16_t OC2TSS:1;
      uint16_t OC3TSS:1;
      uint16_t OC4TSS:1;
      uint16_t OC1CS:1;
      uint16_t OC2CS:1;
      uint16_t OC3CS:1;
      uint16_t OC4CS:1;
      uint16_t IC1TSS:1;
      uint16_t IC2TSS:1;
      uint16_t IC3TSS:1;
      uint16_t IC4TSS:1;
      uint16_t ADCTS1:1;
      uint16_t ADCTS2:1;
      uint16_t ADCTS3:1;
      uint16_t ADCTS4:1;
    };
    struct {
      uint16_t PTGBTE:16;
    };
  };
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile uint16_t PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile uint16_t PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile uint16_t PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile uint16_t PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile uint16_t PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile uint16_t PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile uint16_t PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile uint16_t PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile uint16_t PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  uint16_t PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile uint16_t PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  uint16_t STEP0:8;
  uint16_t STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile uint16_t PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  uint16_t STEP2:8;
  uint16_t STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile uint16_t PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  uint16_t STEP4:8;
  uint16_t STEP5:8;
} PTGQUE2BITS;
extern volatile PTGQUE2BITS PTGQUE2bits __attribute__((__sfr__));

#define PTGQUE3 PTGQUE3
extern volatile uint16_t PTGQUE3 __attribute__((__sfr__));
typedef struct tagPTGQUE3BITS {
  uint16_t STEP6:8;
  uint16_t STEP7:8;
} PTGQUE3BITS;
extern volatile PTGQUE3BITS PTGQUE3bits __attribute__((__sfr__));

#define PTGQUE4 PTGQUE4
extern volatile uint16_t PTGQUE4 __attribute__((__sfr__));
typedef struct tagPTGQUE4BITS {
  uint16_t STEP8:8;
  uint16_t STEP9:8;
} PTGQUE4BITS;
extern volatile PTGQUE4BITS PTGQUE4bits __attribute__((__sfr__));

#define PTGQUE5 PTGQUE5
extern volatile uint16_t PTGQUE5 __attribute__((__sfr__));
typedef struct tagPTGQUE5BITS {
  uint16_t STEP10:8;
  uint16_t STEP11:8;
} PTGQUE5BITS;
extern volatile PTGQUE5BITS PTGQUE5bits __attribute__((__sfr__));

#define PTGQUE6 PTGQUE6
extern volatile uint16_t PTGQUE6 __attribute__((__sfr__));
typedef struct tagPTGQUE6BITS {
  uint16_t STEP12:8;
  uint16_t STEP13:8;
} PTGQUE6BITS;
extern volatile PTGQUE6BITS PTGQUE6bits __attribute__((__sfr__));

#define PTGQUE7 PTGQUE7
extern volatile uint16_t PTGQUE7 __attribute__((__sfr__));
typedef struct tagPTGQUE7BITS {
  uint16_t STEP14:8;
  uint16_t STEP15:8;
} PTGQUE7BITS;
extern volatile PTGQUE7BITS PTGQUE7bits __attribute__((__sfr__));

#define DMA0CON DMA0CON
extern volatile uint16_t DMA0CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA0CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA0CONBITS;
extern volatile DMA0CONBITS DMA0CONbits __attribute__((__sfr__));

#define DMA0REQ DMA0REQ
extern volatile uint16_t DMA0REQ __attribute__((__sfr__));
__extension__ typedef struct tagDMA0REQBITS {
  union {
    struct {
      uint16_t IRQSEL:8;
      uint16_t :7;
      uint16_t FORCE:1;
    };
    struct {
      uint16_t IRQSEL0:1;
      uint16_t IRQSEL1:1;
      uint16_t IRQSEL2:1;
      uint16_t IRQSEL3:1;
      uint16_t IRQSEL4:1;
      uint16_t IRQSEL5:1;
      uint16_t IRQSEL6:1;
      uint16_t IRQSEL7:1;
    };
  };
} DMA0REQBITS;
extern volatile DMA0REQBITS DMA0REQbits __attribute__((__sfr__));

#define DMA0STAL DMA0STAL
extern volatile uint16_t DMA0STAL __attribute__((__sfr__));
#define DMA0STAH DMA0STAH
extern volatile uint16_t DMA0STAH __attribute__((__sfr__));
typedef struct tagDMA0STAHBITS {
  uint16_t STA:8;
} DMA0STAHBITS;
extern volatile DMA0STAHBITS DMA0STAHbits __attribute__((__sfr__));

#define DMA0STBL DMA0STBL
extern volatile uint16_t DMA0STBL __attribute__((__sfr__));
#define DMA0STBH DMA0STBH
extern volatile uint16_t DMA0STBH __attribute__((__sfr__));
typedef struct tagDMA0STBHBITS {
  uint16_t STB:8;
} DMA0STBHBITS;
extern volatile DMA0STBHBITS DMA0STBHbits __attribute__((__sfr__));

#define DMA0PAD DMA0PAD
extern volatile uint16_t DMA0PAD __attribute__((__sfr__));
#define DMA0CNT DMA0CNT
extern volatile uint16_t DMA0CNT __attribute__((__sfr__));
typedef struct tagDMA0CNTBITS {
  uint16_t CNT:14;
} DMA0CNTBITS;
extern volatile DMA0CNTBITS DMA0CNTbits __attribute__((__sfr__));

#define DMA1CON DMA1CON
extern volatile uint16_t DMA1CON __attribute__((__sfr__));
__extension__ typedef struct tagDMA1CONBITS {
  union {
    struct {
      uint16_t MODE:2;
      uint16_t :2;
      uint16_t AMODE:2;
      uint16_t :5;
      uint16_t NULLW:1;
      uint16_t HALF:1;
      uint16_t DIR:1;
      uint16_t SIZE:1;
      uint16_t CHEN:1;
    };
    struct {
      uint16_t MODE0:1;
      uint16_t MODE1:1;
      uint16_t :2;
      uint16_t AMODE0:1;
      uint16_t AMODE1:1;
    };
  };
} DMA1CONBITS;
extern volatile DMA1CONBITS DMA1CONbits __attribute__((__sfr__));

